Repository: Hans-Peter60/BackPlaner
Catalog: BackPlaner/Localizable.xcstrings
Source language: de
Languages: en, fr

source: Dauer in Minuten
en: Duration in minutes
fr: Durée en minutes

source: Dauer übernehmen
en: Apply duration
fr: Appliquer la durée

source: Dauer: %lld Minuten
en: Duration: %lld minutes
fr: Durée : %lld minutes

source: Dauer: %lld Std.
en: Duration: %lld h
fr: Durée : %lld h

# Dauer: %lld Std. %lld Min.
source: Dauer: %1$lld Std. %2$lld Min.
en: Duration: %1$lld h %2$lld min
fr: Durée : %1$lld h %2$lld min

source: Dauer: 1 Minute
en: Duration: 1 minute
fr: Durée : 1 minute

source: Deine besten Rezepte
en: Your best recipes
fr: Vos meilleures recettes

source: Deine gespeicherten Rezepte
en: Your saved recipes
fr: Vos recettes enregistrées

source: Deine privaten Rezepte in der Rezept-Datenbank sind erst wieder sichtbar, wenn Du Dich erneut anmeldest. Rezepte auf diesem Gerät und von Dir veröffentlichte Rezepte bleiben unberührt.
en: Your private recipes in the recipe database become visible again only after you sign in. Recipes on this device and recipes you published are untouched.
fr: Vos recettes privées dans la base de recettes ne seront de nouveau visibles qu’après une nouvelle connexion. Les recettes présentes sur cet appareil et celles que vous avez publiées ne sont pas touchées.

source: Deine privaten Rezepte in der Rezept-Datenbank werden mit ihren Bildern gelöscht und die Anmeldung wird aufgehoben. Rezepte, die Du veröffentlicht hast, bleiben für alle Nutzer sichtbar. Rezepte auf diesem Gerät bleiben erhalten. Das lässt sich nicht widerrufen.
en: Your private recipes in the recipe database are deleted along with their images, and your Apple Account is unlinked. Recipes you’ve published stay visible to all users. Recipes on this device are kept. This can’t be undone.
fr: Vos recettes privées dans la base de recettes sont supprimées avec leurs images et votre compte Apple est dissocié. Les recettes que vous avez publiées restent visibles par tous les utilisateurs. Les recettes présentes sur cet appareil sont conservées. Cette action est irréversible.

source: Deine privaten Rezepte und die Anmeldung sind entfernt. Du kannst die App weiter verwenden und Dich jederzeit neu anmelden.
en: Your private recipes and your sign-in have been removed. You can keep using the app and sign in again at any time.
fr: Vos recettes privées et votre connexion ont été supprimées. Vous pouvez continuer à utiliser l’app et vous reconnecter à tout moment.

source: Der Backbeginn (%1$@) liegt nur %2$lld Minuten nach dem Backende von „%3$@“. Die Backpause beträgt %4$lld Minuten.
en: The start of baking (%1$@) is only %2$lld minutes after the end of baking for “%3$@”. The baking pause is %4$lld minutes.
fr: Le début de la cuisson (%1$@) n’a lieu que %2$lld minutes après la fin de la cuisson de « %3$@ ». La pause entre deux cuissons est de %4$lld minutes.

source: Der erkannte Rezeptentwurf wird erst gespeichert, wenn Du ihn anschließend prüfst und ausdrücklich speicherst. Dabei gilt die von Dir gewählte lokale, private oder öffentliche Ablage.
en: The recognized recipe draft is only saved once you have reviewed it and explicitly save it. The local, private, or public storage you chose then applies.
fr: Le brouillon de recette reconnu n’est enregistré qu’après que vous l’avez vérifié et enregistré explicitement. C’est alors l’emplacement local, privé ou public que vous avez choisi qui s’applique.

source: Der geplante Schritt ist nicht mehr vorhanden.
en: The scheduled step no longer exists.
fr: L’étape planifiée n’existe plus.

source: Der Rezepttext der Seite wird verschlüsselt über den geschützten BackPlaner-Server von Google Vertex AI analysiert. Dafür ist einmalig Deine Einwilligung nötig.
en: The page’s recipe text is analyzed by Google Vertex AI through the protected BackPlaner server, in encrypted form. This requires your consent once.
fr: Le texte de recette de la page est analysé de manière chiffrée par Google Vertex AI via le serveur protégé de BackPlaner. Votre consentement est nécessaire une seule fois.

source: Der Rezepttext der von Dir angegebenen Internetseite und ihre Adresse werden verschlüsselt an den geschützten Firebase-Endpunkt von BackPlaner und von dort an Google Vertex AI übertragen. Google ist dabei ein externer KI-Anbieter. Zur Absicherung und Nutzungsbegrenzung werden außerdem eine pseudonyme Firebase-Nutzerkennung, der App-Check-Nachweis sowie Anfragezeit und -anzahl verarbeitet.
en: The recipe text of the web page you entered and its address are transmitted in encrypted form to BackPlaner’s protected Firebase endpoint and from there to Google Vertex AI. Google is an external AI provider. To secure the service and limit usage, a pseudonymous Firebase user ID, the App Check attestation, and the time and number of requests are also processed.
fr: Le texte de recette de la page web que vous avez indiquée ainsi que son adresse sont transmis de manière chiffrée au point de terminaison Firebase protégé de BackPlaner, puis à Google Vertex AI. Google est un fournisseur d’IA externe. Pour la sécurisation et la limitation d’usage, un identifiant d’utilisateur Firebase pseudonyme, l’attestation App Check ainsi que l’heure et le nombre des demandes sont également traités.

source: Der Seitentext verlässt das Gerät nicht. Ohne Apple Intelligence werden nur die strukturierten Rezeptdaten der Seite übernommen.
en: The page text does not leave the device. Without Apple Intelligence, only the page’s structured recipe data is used.
fr: Le texte de la page ne quitte pas l’appareil. Sans Apple Intelligence, seules les données de recette structurées de la page sont reprises.

source: Der verschobene Zeitpunkt muss in der Zukunft liegen.
en: The rescheduled time must be in the future.
fr: L’heure décalée doit se situer dans le futur.

source: Der Widerruf gilt für alle zukünftigen Analysen. Bereits abgeschlossene Verarbeitungen werden dadurch nicht rückwirkend aufgehoben.
en: Withdrawal applies to all future analyses. Processing that has already been completed is not undone retroactively.
fr: Le retrait s’applique à toutes les analyses futures. Les traitements déjà effectués ne sont pas annulés rétroactivement.

source: Der zugehörige Reminder wurde nicht gefunden.
en: The associated reminder wasn’t found.
fr: Le rappel associé est introuvable.

source: Detailansicht verwenden
en: Use detail view
fr: Utiliser la vue détaillée

source: Details zu %@
en: Details for %@
fr: Détails de %@

source: Deutsch
en: German
fr: Allemand

source: Die Adresse ist keine gültige Internetadresse. Sie muss mit https:// beginnen oder einen Domainnamen enthalten.
en: This is not a valid web address. It must start with https:// or contain a domain name.
fr: Cette adresse n’est pas une adresse web valide. Elle doit commencer par https:// ou contenir un nom de domaine.

source: Die Analyse in der Cloud erfolgt nur auf Grundlage Deiner vorherigen ausdrücklichen Einwilligung. Ohne Einwilligung wird keine Cloud-Analyse gestartet.
en: Analysis in the cloud only takes place on the basis of your prior explicit consent. Without consent, no cloud analysis is started.
fr: L’analyse dans le cloud n’a lieu que sur la base de votre consentement préalable et explicite. Sans consentement, aucune analyse cloud n’est lancée.

source: Die Anmeldung wird für private Cloud-Rezepte benötigt: nur so bleiben sie nach einer Neuinstallation erreichbar. Administratoren verwalten damit gemeldete Rezepte.
en: Signing in is required for private cloud recipes: it’s the only way they stay accessible after you reinstall the app. Administrators use it to manage reported recipes.
fr: La connexion est nécessaire pour les recettes privées dans le cloud : c’est le seul moyen de les garder accessibles après une réinstallation. Les administrateurs s’en servent pour gérer les recettes signalées.

source: Die ausgewählten Bilder werden verschlüsselt über den geschützten BackPlaner-Server von Google Vertex AI analysiert. Dafür ist einmalig Deine Einwilligung nötig.
en: The selected images are analyzed by Google Vertex AI through the protected BackPlaner server, in encrypted form. This requires your consent once.
fr: Les images sélectionnées sont analysées de manière chiffrée par Google Vertex AI via le serveur protégé de BackPlaner. Votre consentement est nécessaire une seule fois.

source: Die Backzeit (%1$@) überschneidet sich mit %2$@. Zusammen wären das mehr Backvorgänge, als Du Backöfen hast (%3$lld).
en: The baking time (%1$@) overlaps with %2$@. Together that would be more bakes than you have ovens (%3$lld).
fr: Le temps de cuisson (%1$@) chevauche %2$@. Cela ferait plus de cuissons simultanées que vous n’avez de fours (%3$lld).

source: Die Backzeit (%1$@) überschneidet sich mit der Backzeit von „%2$@“ (%3$@) und braucht deshalb einen weiteren Backofen.
en: The baking time (%1$@) overlaps with the baking time of “%2$@” (%3$@) and therefore needs another oven.
fr: Le temps de cuisson (%1$@) chevauche le temps de cuisson de « %2$@ » (%3$@) et nécessite donc un four supplémentaire.

# Die Backzeit (%@) überschneidet sich mit der Backzeit von „%@“ (%@).
source: Die Backzeit (%1$@) überschneidet sich mit der Backzeit von „%2$@“ (%3$@).
en: The baking time (%1$@) overlaps with the baking time of “%2$@” (%3$@).
fr: Le temps de cuisson (%1$@) chevauche le temps de cuisson de « %2$@ » (%3$@).

# Die berechnete Teigausbeute (%lld) weicht von der angegebenen (%lld) ab.
source: Die berechnete Teigausbeute (%1$lld) weicht von der angegebenen (%2$lld) ab.
en: The calculated dough yield (%1$lld) differs from the specified value (%2$lld).
fr: Le rendement de la pâte calculé (%1$lld) diffère de celui indiqué (%2$lld).

source: Die Bilder verlassen das Gerät nicht. Die Erkennung kann weniger genau sein als mit der Cloud-KI.
en: The images do not leave the device. Recognition may be less accurate than with the cloud AI.
fr: Les images ne quittent pas l’appareil. La reconnaissance peut être moins précise qu’avec l’IA cloud.

source: Die Bilder werden ausschließlich analysiert, um daraus einen Rezeptentwurf mit Zutaten und Arbeitsschritten zu erstellen. BackPlaner speichert die zur Analyse übertragenen Bilder nicht in Firebase Storage oder in der Rezept-Datenbank.
en: The images are analyzed solely to create a recipe draft with ingredients and steps. BackPlaner does not store the images transmitted for analysis in Firebase Storage or in the recipe database.
fr: Les images sont analysées uniquement pour en créer un brouillon de recette avec les ingrédients et les étapes. BackPlaner n’enregistre pas les images transmises pour l’analyse dans Firebase Storage ni dans la base de données de recettes.

source: Die Cloud-KI wird nur nach Deiner ausdrücklichen Einwilligung verwendet. Eine lokale Analyse bleibt immer verfügbar.
en: The cloud AI is only used with your explicit consent. Local analysis always remains available.
fr: L’IA cloud n’est utilisée qu’avec votre consentement explicite. L’analyse locale reste toujours disponible.

source: Die Daten werden verschlüsselt an eine geschützte Google Firebase Cloud Function von BackPlaner in der Region europe-west1 übertragen. Die ausgewählten Bilder beziehungsweise der Seitentext werden von dort an Google Vertex AI (Gemini) am Standort EU zur Analyse weitergegeben. Die Internetseite selbst lädt Dein Gerät direkt.
en: The data is transmitted in encrypted form to a protected Google Firebase Cloud Function of BackPlaner in the europe-west1 region. From there, the selected images or the page text are passed on to Google Vertex AI (Gemini) in the EU for analysis. The web page itself is loaded directly by your device.
fr: Les données sont transmises de manière chiffrée à une Cloud Function Google Firebase protégée de BackPlaner dans la région europe-west1. De là, les images sélectionnées ou le texte de la page sont transmis à Google Vertex AI (Gemini), situé dans l’UE, pour analyse. La page web elle-même est chargée directement par votre appareil.

source: Die KI erstellt lediglich einen bearbeitbaren Rezeptentwurf. Sie trifft keine rechtlich oder vergleichbar erheblich wirkende Entscheidung. Du kannst das Ergebnis vollständig prüfen, ändern oder verwerfen.
en: The AI only creates an editable recipe draft. It makes no decision with legal or similarly significant effects. You can fully review, change, or discard the result.
fr: L’IA se contente de créer un brouillon de recette modifiable. Elle ne prend aucune décision produisant des effets juridiques ou des effets similaires significatifs. Vous pouvez vérifier, modifier ou rejeter entièrement le résultat.

source: Die Menge gilt für diese Einkaufsliste. Das Rezept bleibt unverändert.
en: The amount applies to this shopping list. The recipe stays unchanged.
fr: La quantité s’applique à cette liste de courses. La recette reste inchangée.

source: Die Rezeptdatenbank hat noch keine Einträge geladen.
en: The recipe database has not loaded any entries yet.
fr: La base de recettes n’a pas encore chargé d’entrées.

source: Die Seite konnte nicht geladen werden (Fehler %lld). Manche Seiten verlangen eine Anmeldung oder sperren den Abruf.
en: The page could not be loaded (error %lld). Some pages require a login or block automated access.
fr: La page n’a pas pu être chargée (erreur %lld). Certaines pages exigent une connexion ou bloquent l’accès automatisé.

source: Die Seite konnte nicht geladen werden. Bitte prüfe die Adresse und die Internetverbindung.
en: The page could not be loaded. Please check the address and your internet connection.
fr: La page n’a pas pu être chargée. Vérifiez l’adresse et la connexion Internet.

source: Die Seite selbst wird von Deinem Gerät geladen. Der Text wird ausschließlich analysiert, um daraus einen Rezeptentwurf mit Zutaten und Arbeitsschritten zu erstellen. BackPlaner speichert den übertragenen Text nicht in Firebase Storage oder in der Rezept-Datenbank.
en: The page itself is loaded by your device. The text is analyzed solely to create a recipe draft with ingredients and steps. BackPlaner does not store the transmitted text in Firebase Storage or in the recipe database.
fr: La page elle-même est chargée par votre appareil. Le texte est analysé uniquement pour en créer un brouillon de recette avec les ingrédients et les étapes. BackPlaner n’enregistre pas le texte transmis dans Firebase Storage ni dans la base de données de recettes.

source: Die Summe der erkannten Zutaten (%1$lld g) weicht von der angegebenen Teigmenge (%2$lld g) ab.
en: The sum of the detected ingredients (%1$lld g) differs from the specified dough weight (%2$lld g).
fr: La somme des ingrédients détectés (%1$lld g) diffère du poids de pâte indiqué (%2$lld g).

source: Die Umrechnung muss größer als 0 sein.
en: The conversion has to be greater than 0.
fr: La conversion doit être supérieure à 0.

source: Die Verarbeitung erfolgt ausschließlich, um Zutaten, Mengen, Zeiten und Arbeitsschritte aus den Bildern oder dem Seitentext zu erkennen und daraus einen Rezeptentwurf zu erstellen. Die technischen Daten dienen der Absicherung des Endpunkts und dem Schutz vor missbräuchlicher oder übermäßiger Nutzung.
en: Processing takes place solely to recognize ingredients, amounts, times, and steps in the images or the page text and to create a recipe draft from them. The technical data serves to secure the endpoint and to protect against abusive or excessive use.
fr: Le traitement sert exclusivement à reconnaître les ingrédients, les quantités, les durées et les étapes dans les images ou le texte de la page, puis à en créer un brouillon de recette. Les données techniques servent à sécuriser le point de terminaison et à le protéger contre une utilisation abusive ou excessive.

source: Die von Dir ausgewählten Rezeptbilder werden verschlüsselt an den geschützten Firebase-Endpunkt von BackPlaner und von dort an Google Vertex AI übertragen. Google ist dabei ein externer KI-Anbieter. Zur Absicherung und Nutzungsbegrenzung werden außerdem eine pseudonyme Firebase-Nutzerkennung, der App-Check-Nachweis sowie Anfragezeit und -anzahl verarbeitet.
en: The recipe images you selected are transmitted in encrypted form to BackPlaner’s protected Firebase endpoint and from there to Google Vertex AI. Google is an external AI provider in this process. For security and usage limits, a pseudonymous Firebase user ID, the App Check token, and the time and number of requests are also processed.
fr: Les images de recettes que vous avez sélectionnées sont transmises de manière chiffrée au point de terminaison Firebase protégé de BackPlaner, puis de là à Google Vertex AI. Google intervient ici en tant que fournisseur d’IA externe. Pour la sécurité et la limitation d’utilisation, un identifiant utilisateur Firebase pseudonyme, le jeton App Check ainsi que l’heure et le nombre de requêtes sont également traités.

source: Dies entfernt alle geplanten Schritte und die zugehörigen Erinnerungen.
en: This removes all scheduled steps and their reminders.
fr: Cela supprime toutes les étapes planifiées et leurs rappels associés.

source: Dieses Rezept wird als Administrator endgültig aus der öffentlichen Datenbank entfernt.
en: This recipe will be permanently removed from the public database as an administrator.
fr: Cette recette sera supprimée définitivement de la base de données publique en tant qu'administrateur.

source: Dieses Rezept wurde gemeldet und ist für alle anderen Nutzer ausgeblendet.
en: This recipe has been reported and is hidden from all other users.
fr: Cette recette a été signalée et est masquée pour tous les autres utilisateurs.

source: Du bist abgemeldet
en: You’re signed out
fr: Déconnexion effectuée

source: Du hast die Wahl
en: You have the choice
fr: Vous avez le choix

source: Du hast noch keine eigene Einheit angelegt. Die mitgelieferten Einheiten stehen in der Auswahlliste immer zur Verfügung.
en: You haven’t added a unit of your own yet. The units that come with the app are always available in the list.
fr: Vous n’avez pas encore ajouté d’unité personnalisée. Les unités fournies avec l’app sont toujours disponibles dans la liste.

source: Du kannst den bestehenden Plan ersetzen oder beide behalten – etwa für zwei Backtage.
en: You can replace the existing plan or keep both — for two baking days, say.
fr: Vous pouvez remplacer le plan existant ou garder les deux — pour deux jours de cuisson, par exemple.

source: Du kannst die Einwilligung später unter Einstellungen › Datenschutz & KI widerrufen.
en: You can withdraw your consent later under Settings › Privacy & AI.
fr: Vous pouvez retirer votre consentement plus tard sous Réglages › Confidentialité et IA.

source: Du kannst stattdessen jederzeit die lokale Analyse verwenden. Dann verlassen die Bilder Dein Gerät nicht.
en: You can use the local analysis instead at any time. The images then do not leave your device.
fr: Vous pouvez à tout moment utiliser l’analyse locale à la place. Les images ne quittent alors pas votre appareil.

source: Du kannst stattdessen jederzeit die lokale Analyse verwenden. Dann verlässt der Seitentext Dein Gerät nicht.
en: You can use the local analysis instead at any time. The page text then does not leave your device.
fr: Vous pouvez à tout moment utiliser l’analyse locale à la place. Le texte de la page ne quitte alors pas votre appareil.

source: Eigene Einheiten
en: Custom units
fr: Unités personnalisées

source: Eigene Rezepte
en: My recipes
fr: Mes recettes

source: Eigene Rezepte öffnen
en: Open my recipes
fr: Ouvrir mes recettes

source: Ein öffentliches Rezept kann nach dem Speichern nicht mehr geändert werden.
en: A public recipe can no longer be changed after it has been saved.
fr: Une recette publique ne peut plus être modifiée après son enregistrement.

source: Ein Rezept in der Rezept-Datenbank kann nach dem Speichern nicht mehr geändert werden. Es ist nur für Dich sichtbar.
en: A recipe in the recipe database can no longer be changed after it has been saved. It’s visible only to you.
fr: Une recette dans la base de recettes ne peut plus être modifiée après son enregistrement. Elle n’est visible que par vous.

source: Ein Rezept von Grund auf erstellen
en: Create a recipe from scratch
fr: Créer une recette de zéro

source: Eine Einheit sagt der App, wie sie eine Menge in ein Gewicht umrechnet. Davon leben die Gesamtzutaten, die Bäckerprozente und die Einkaufsliste. Deshalb braucht auch eine eigene Einheit eine Umrechnung — ohne sie würde „2 Becher Mehl“ als 2 Gramm zählen.
en: A unit tells the app how to turn an amount into a weight. The total ingredients, the baker’s percentages and the shopping list all depend on it, which is why a unit of your own needs a conversion too — without one, “2 cups of flour” would count as 2 grams.
fr: Une unité indique à l’app comment convertir une quantité en poids. Le total des ingrédients, les pourcentages boulangers et la liste de courses en dépendent : c’est pourquoi une unité personnalisée a aussi besoin d’une conversion. Sans elle, « 2 tasses de farine » compterait pour 2 grammes.

source: Eine Einwilligung kannst Du direkt beim Rezeptimport erteilen, nachdem Dir die Datenübertragung erklärt wurde.
en: You can give consent directly during recipe import, after the data transfer has been explained to you.
fr: Vous pouvez donner votre consentement directement lors de l’importation d’une recette, après que le transfert de données vous a été expliqué.

source: Einheit
en: Unit
fr: Unité

source: Einheit auswählen
en: Select unit
fr: Sélectionner une unité

source: Einheit auswählen, unbekannte Einheit
en: Select unit, unknown unit
fr: Sélectionner une unité, unité inconnue

source: Einheit hinzufügen
en: Add unit
fr: Ajouter une unité

source: Einheit nicht angelegt
en: Unit not added
fr: Unité non ajoutée

source: Einkaufsliste
en: Shopping list
fr: Liste de courses

source: Einkaufsliste erstellen
en: Create shopping list
fr: Créer une liste de courses

source: Einkaufsliste löschen
en: Delete shopping list
fr: Supprimer la liste de courses

source: Einkaufslisten
en: Shopping lists
fr: Listes de courses

source: Einkaufslisten anzeigen
en: Show shopping lists
fr: Afficher les listes de courses

source: Einstellungen
en: Settings
fr: Réglages

source: Einwilligung und Widerruf
en: Consent and withdrawal
fr: Consentement et retrait

source: Einwilligung widerrufen
en: Withdraw consent
fr: Retirer le consentement

source: Einwilligung zur Cloud-KI widerrufen
en: Withdraw consent to cloud AI
fr: Retirer le consentement à l’IA cloud

source: Empfänger und Verarbeitungsort
en: Recipients and place of processing
fr: Destinataires et lieu de traitement

source: Englisch
en: English
fr: Anglais

source: Entferne nur die geplanten Schritte von „%@“ samt Erinnerungen – oder alle geplanten Schritte.
en: Remove only the scheduled steps for “%@” and their reminders – or all scheduled steps.
fr: Supprimez uniquement les étapes planifiées de « %@ » et leurs rappels – ou toutes les étapes planifiées.

source: Erkannte Vorlage
en: Detected source
fr: Source détectée

source: Erkannte Zeitplanung
en: Detected schedule
fr: Planification détectée

source: Erkanntes Rezept
en: Detected recipe
fr: Recette détectée

source: Erledigt
en: Mark as done
fr: Marquer comme terminé

source: Erneut anmelden
en: Sign in again
fr: Se reconnecter

source: Erstelle eine Einkaufsliste direkt aus einem Rezept.
en: Create a shopping list directly from a recipe.
fr: Créez une liste de courses directement depuis une recette.

source: Erstelle zuerst eine neue Liste.
en: Create a new list first.
fr: Créez d’abord une nouvelle liste.

source: Erstellen
en: Create
fr: Créer

source: Erstellt mit BakePlanner
en: Created with BakePlanner
fr: Créé avec BakePlanner
